Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.Revision.IsCurrentRevision Property
 Gets the value indicating whether this revision is the current revision or not.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsCurrentRevision {
	get;
 }
Public ReadOnly Property IsCurrentRevision As Boolean
		Get
Property Value
Type: Boolean
 The currentness of the revision.
See Also
Reference
ReferenceModel.Revision Structure
Tekla.Structures.Model Namespace